cnt = 0
page = 0
root = ''
var = ''
value_inside_1 = ''
value_inside_2 = ''
value_inside_3 = ''
value_inside_4 = ''
value_inside_5 = ''
value_inside_6 = ''
value_inside_7 = ''
value_1 = ''
value_2 = ''
value_3 = ''
value_4 = ''
value_5 = ''
ro = ''
json = ''
login_entry = ''
password_entry = ''
password_entry_2 = ''
category = 0
json_1 = {
	'T1':'DDoS атаки',
	'T2':'Вредоносные программы',
	'T3':'Манипулирование информацией',
	'T4':'Таргетированные атаки',
	'T5':'Брутфорс атака'
}
json_2 = {
	'T1':'DDoS атаки',
	'T2':'Программы-вымогатели',
	'T3':'Вирусы',
	'T4':'Троянский конь',
	'T5':'Шпионские программы'
}
json_3 = {
	'T1':'Нарушение связи',
	'T2':'DDoS атаки',
	'T3':'Управление промышленным роботом',
	'T4':'Атаки с использованием ИИ',
	'T5':'Физические атаки'
}
json_4 = {
	'T1':'Раскрытие пароля',
	'T2':'Активное прослушивание',
	'T3':'Кража информации',
	'T4':'Злоупотребление личными данными',
	'T5':'SQL-инъекция'
}
json_5 = {
	'T1':'Отказ в обслуживании',
	'T2':'Вредоносное ПО',
	'T3':'Манипуляции с информацией',
	'T4':'Непреднамеренное изменение данных'
}
json_6 = {
	'T1':'Кража',
	'T2':'Нехватка квалифицированных кадров',
	'T3':'Человеческая ошибка'
}
json_7 = {
	'T1':'Управление конфигурацией устройства / SCADA',
	'T2':'Эксплуатация уязвимостей программного обеспечения',
	'T3':'Несанкционированный доступ к программному обеспечению',
	'T4':'Ввод ложной информации в программное обеспечение',
	'T5':'Человеческая ошибка в программе'
}
cr_options_default = ['Временные издержки', 'Предыдущие угрозы', 'Привлекательность актива', 'Существующий контроль', 'Ущерб репутации', 'Уязвимость', 'Финансовые  затраты']
options_list = ['Незначительный (VL)', 'Низкий (L)', 'Средний (M)', 'Высокий (H)', 'Критический (VH)']
cr_json = {'Незначительный (VL)':0.04, 'Низкий (L)':0.09, 'Средний (M)':0.15, 'Высокий (H)':0.21, 'Критический (VH)':0.26}
t_list = ['Очень слабый (VP)', 'Слабый (P)', 'Удовлетворительный (F)', 'Хороший (G)', 'Очень хороший (VG)']
t_json = {'Очень слабый (VP)':[0, 0, 0.1], 'Слабый (P)':[0, 0.1, 0.3], 'Удовлетворительный (F)':[0.3, 0.5, 0.7], 'Хороший (G)':[0.5, 0.7, 0.9], 'Очень хороший (VG)':[0.7, 0.9, 1], 'Выбрать':[0, 0, 0]}
ro_json = {1:0.20472352, 2:0.17816557, 3:0.14135012, 4:0.138129493, 5:0.125127163, 6:0.115974993, 7:0.096529143}
cr_1_3 = {'T1':[0, 0, 0], 'T2':[0, 0, 0], 'T3':[0, 0, 0], 'T4':[0, 0, 0], 'T5':[0, 0, 0]}
cr_4_7 = {'T1':[0, 0, 0], 'T2':[0, 0, 0], 'T3':[0, 0, 0], 'T4':[0, 0, 0], 'T5':[0, 0, 0]}
risks = {'T1':0, 'T2':0, 'T3':0, 'T4':0, 'T5':0}
weight = {1:0.20472352, 2:0.17816557, 3:0.14135012, 4:0.1381294925, 5:0.1251271625, 6:0.1159749925, 7:0.0965291425}
t_values_2 = []
t_values_3 = []
t_values_4 = []
t_values_5 = []
t_values_6 = []
t_values_7 = []
